micropython/micropython/ports/stm32/eth.c
    // Allocate TX buffer slots.
    unsigned int idx = 0;
    for (struct pbuf *pb = p; pb != NULL; pb = pb->next) {
        int ret = eth_tx_buf_get_ref(pb->len, pb->payload, idx++);
        if (ret != 0) {
            if (made_pbuf_copy) {
                pbuf_free(p);
            }
            return ERR_BUF;
        }
    }

    // Take references to pbufs
    idx = 0;
    for (struct pbuf *pb = p; pb != NULL; pb = pb->next) {
        unsigned int tx_idx = (eth_dma_tx_descr_idx + idx) % TX_BUF_NUM;
        if (eth_dma_pbuf[tx_idx] != NULL) {
            pbuf_free(eth_dma_pbuf[tx_idx]);
        }
        if (!made_pbuf_copy) {
            pbuf_ref(pb);
        }
        eth_dma_pbuf[tx_idx] = pb;
        ++idx;
    }

    // Start the transmission.
    int ret = eth_tx_buf_send(num_segments);

    #else

    // Allocate TX slot, copy the pbuf, and start the transmission.
    uint8_t *buf;
    int ret = eth_tx_buf_get(p->tot_len, &buf);
    if (ret == 0) {
        pbuf_copy_partial(p, buf, p->tot_len, 0);
        ret = eth_tx_buf_send(1);
    }

    #endif

    return ret ? ERR_BUF : ERR_OK;
}

static err_t eth_netif_init(struct netif *netif) {
    netif->linkoutput = eth_netif_output;
    netif->output = etharp_output;
    netif->mtu = 1500;
    netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_ETHERNET | NETIF_FLAG_IGMP;
    // Checksums only need to be checked on incoming frames, not computed on outgoing frames
    NETIF_SET_CHECKSUM_CTRL(netif,
        NETIF_CHECKSUM_CHECK_IP
        | NETIF_CHECKSUM_CHECK_UDP
        | NETIF_CHECKSUM_CHECK_TCP
        | NETIF_CHECKSUM_CHECK_ICMP
        | NETIF_CHECKSUM_CHECK_ICMP6);
    return ERR_OK;
}

static void eth_lwip_init(eth_t *self) {
    MICROPY_PY_LWIP_ENTER

    struct netif *n = &self->netif;
    n->name[0] = 'e';
    n->name[1] = '0';
    n->state = self;

    // Set default IP configuration (0.0.0.0 = use DHCP).
    ip_addr_t ipconfig[4];
    IP4_ADDR(&ipconfig[0], 0, 0, 0, 0);        // IP: 0.0.0.0 (DHCP)
    IP4_ADDR(&ipconfig[1], 255, 255, 255, 0);   // Netmask
    IP4_ADDR(&ipconfig[2], 192, 168, 0, 1);     // Gateway
    IP4_ADDR(&ipconfig[3], 8, 8, 8, 8);         // DNS

    netif_add(n, ip_2_ip4(&ipconfig[0]), ip_2_ip4(&ipconfig[1]), ip_2_ip4(&ipconfig[2]), self, eth_netif_init, ethernet_input);
    netif_set_hostname(n, mod_network_hostname_data);

    dns_setserver(0, &ipconfig[3]);

    // Initialize DHCP structure.
    dhcp_set_struct(n, &self->dhcp_struct);

    #if LWIP_IPV6
    netif_create_ip6_linklocal_address(n, 1);
    #endif
    MICROPY_PY_LWIP_EXIT
}

// Restart DHCP if no static IP is configured.
// Used when link comes up, MAC is reconfigured, or interface starts.
static void eth_dhcp_restart_if_needed(struct netif *netif) {
    if (netif_is_up(netif) && ip4_addr_isany_val(*netif_ip4_addr(netif))) {
        if (netif_dhcp_data(netif)) {
            dhcp_stop(netif);
        }
        dhcp_start(netif);
    }
}

void eth_phy_link_status_poll(void) {
    eth_t *self = &eth_instance;
    if (!self->enabled) {
        return;
    }

    // Poll PHY link status and handle state changes.
    // PHY_BSR link status bit is latched-low (IEEE 802.3): requires two
    // reads to get current state.
    uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);
    bsr = eth_phy_read(self->phy_addr, PHY_BSR);
    bool current_link_status = (bsr & PHY_BSR_LINK_STATUS) != 0;

    // Check if link status changed.
    if (current_link_status != self->last_link_status) {
        self->last_link_status = current_link_status;

        struct netif *netif = &self->netif;
        MICROPY_PY_LWIP_ENTER
        if (current_link_status) {
            netif_set_link_up(netif);
            self->mac_speed_configured = false;
            self->autoneg_start_ms = mp_hal_ticks_ms();
            eth_dhcp_restart_if_needed(netif);
        } else {
            netif_set_link_down(netif);
            self->mac_speed_configured = false;
            struct dhcp *dhcp = netif_dhcp_data(netif);
            if (dhcp != NULL) {
                dhcp_stop(netif);
            }
        }
        MICROPY_PY_LWIP_EXIT
    }

    // If link is up but MAC speed/duplex not yet configured, check if
    // autoneg is complete.
    if (current_link_status && !self->mac_speed_configured) {
        if (!self->last_link_status) {
            return;
        }

        bsr = eth_phy_read(self->phy_addr, PHY_BSR);
        bool autoneg_timeout = (mp_hal_ticks_ms() - self->autoneg_start_ms) > PHY_AUTONEG_TIMEOUT_MS;

        if ((bsr & PHY_BSR_AUTONEG_DONE) || autoneg_timeout) {
            uint16_t phy_speed = self->phy_get_link_status(self->phy_addr);

            if (autoneg_timeout && phy_speed == 0) {
                phy_speed = PHY_SPEED_10HALF;
                mp_printf(&mp_plat_print, "ETH: Autonegotiation timeout, using 10Mbps Half-Duplex\n");
            }

            self->mac_reconfig_in_progress = true;

            uint32_t maccr = ETH->MACCR;
            maccr &= ~(ETH_MACCR_TE | ETH_MACCR_RE);
            ETH->MACCR = maccr;

            // Wait for in-flight DMA operations to complete.
            uint32_t poll_start = mp_hal_ticks_ms();
            bool rx_stopped = false;
            while (!rx_stopped && (mp_hal_ticks_ms() - poll_start < 100)) {
                rx_stopped = true;
                for (size_t i = 0; i < RX_BUF_NUM; ++i) {
                    #if defined(STM32H5) || defined(STM32H7) || defined(STM32N6)
                    if (eth_dma.rx_descr[i].rdes3 & (1 << RX_DESCR_3_OWN_Pos)) {
                        rx_stopped = false;
                        break;
                    }
                    #else
                    if (eth_dma.rx_descr[i].rdes0 & (1 << RX_DESCR_0_OWN_Pos)) {
                        rx_stopped = false;
                        break;
                    }
                    #endif
                }
                if (!rx_stopped) {
                    mp_hal_delay_ms(1);
                }
            }

